cf/Documents/СогласованиеАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>СогласованиеАссортимента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТоварыДляПередачи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/InformationRegisters/ЗапросНаСогласованиеТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗапросНаСогласованиеТовара</Name>
			<Comment>Запрос на включение товара в согласованный ассортимент партнера ИПР</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оповещение</Name>
					<Comment>Письмо-оповещение, о том что заявка зарегистрирована в системе</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Письмо</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Письмо</Name>
					<Comment>Письмо о том, что запрос поступил на рассмотрение (пошел по нашему Бизнес-процессу)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Письмо</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСогласования</Name>
					<Comment>Документ, на основании которого было принято решение о согласовании запроса</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеАссортимента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>1 - создан в 1с, 2 - отправлен на рассмотрение 3 - согласован, 4 - не согласован, 5 - все плохо</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиИнтернет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Comment>ID сайта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ТипыТекстовЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыТекстовЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмеченныйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTMLСКартинками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/СогласованиеАссортимента/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
														
	|;
	|ВЫБРАТЬ
	|	Контрагент
	|ИЗ
	|	Документ.СогласованиеАссортимента
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	ДатаНачала Период,
	|	СогласованиеАссортиментаТовары.Номенклатура,
	|	СогласованиеАссортиментаПартнеры.Контрагент,
	|	ИСТИНА Использовать
	|ИЗ
	|	Документ.СогласованиеАссортимента.Товары КАК СогласованиеАссортиментаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.СогласованиеАссортимента.Контрагенты  СогласованиеАссортиментаПартнеры
	|	ПО ИСТИНА
	|ГДЕ
	| СогласованиеАссортиментаТовары.Ссылка = &Ссылка И СогласованиеАссортиментаПартнеры.Ссылка = &Ссылка И ДатаНачала <> ДАТАВРЕМЯ(1,1,1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДатаОкончания Период,
	|	СогласованиеАссортиментаТовары.Номенклатура,
	|	СогласованиеАссортиментаПартнеры.Контрагент,
	|	ЛОЖЬ Использовать
	|ИЗ
	|	Документ.СогласованиеАссортимента.Товары КАК СогласованиеАссортиментаТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.СогласованиеАссортимента.Контрагенты  СогласованиеАссортиментаПартнеры
	|	ПО ИСТИНА
	|ГДЕ
	| СогласованиеАссортиментаТовары.Ссылка = &Ссылка И СогласованиеАссортиментаПартнеры.Ссылка = &Ссылка И ДатаОкончания <> ДАТАВРЕМЯ(1,1,1)");
	
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	Запрос.УстановитьПараметр("Период",Ссылка.Дата);	
	Пакет = Запрос.ВыполнитьПакет();
		
	// Воткнем в структуру
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ТоварыДляПередачи", 			Пакет[2].Выгрузить());	
	
КонецПроцедуры

Функция ПисьмоОРезультатеОбработка(Ссылка, Товары, Контрагенты) Экспорт
	
	// ищем все открытые заявки (статус 1), или заявки ожидающие ответа (статус 2)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Тов.Номенклатура КАК Номенклатура, Тов.ДатаНачала КАК ДатаНачала ПОМЕСТИТЬ Товары ИЗ &Номенклатура КАК Тов
	|;
	|ВЫБРАТЬ Пользователь, Номенклатура, Номенклатура.Артикул Артикул, Контрагент, ID, Период, Оповещение, Письмо 
	|ИЗ РегистрСведений.ЗапросНаСогласованиеТовара 
	|ГДЕ Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ Товары ГДЕ ДатаНачала <> ДАТАВРЕМЯ(1,1,1)) И Контрагент В (&Контрагенты) И (Статус = 1 ИЛИ Статус = 2) 
	|ИТОГИ ПО Пользователь");
	
	Запрос.УстановитьПараметр("Номенклатура", Товары.Выгрузить());
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты.Выгрузить().ВыгрузитьКолонку("Контрагент"));

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПолучатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	URLИнтернетМагазин = Константы.ПутьИнтернетМагазин.Получить();
	
	Менеджер = РегистрыСведений.ЗапросНаСогласованиеТовара;
	
	НачатьТранзакцию();
			
	Пока ВыборкаПолучатель.Следующий() Цикл
		
		ТекстПисьмаТело = "<table>";
		
		Получатель = ВыборкаПолучатель.Пользователь;
		
		Если ТипЗнч(Получатель) = Тип("СправочникСсылка.ПользователиИнтернет") Тогда
			
			Кому = Получатель.ЭлектроннаяПочта;
			ТекстПисьмаЗаголовок = "Уважаемый(ая) " + Получатель + "!" + "<BR><BR> Мы получили ответ от Вашей коммерческой службы по запрашиваемыми позициям и спешим сообщить Вам, что следующие позиции были согласованы:<BR>";	
			
		КонецЕсли;		
	 
		ВыборкаТовары = ВыборкаПолучатель.Выбрать();               
		 
		Пока ВыборкаТовары.Следующий() Цикл
			Товар = ВыборкаТовары.Номенклатура;
			
			//////////////ЗАПИСЬ В РЕГИСТР//////////////
			Запись = Менеджер.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаТовары);
			Запись.ДокументСогласования = Ссылка;
			Запись.Статус = 3; 
			Попытка
				Запись.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Данные.Запись", УровеньЖурналаРегистрации.Ошибка, , , 
				ОписаниеОшибки());
				ОтменитьТранзакцию();
				Возврат Ложь;
			КонецПопытки;
			/////////////////////////////////////////////				
				
			ТекстПисьмаТело = ТекстПисьмаТело + "<tr><td>" + Товар.Артикул + "</td><td><A style=""COLOR: rgb(0,0,204)"" href=" + URLИнтернетМагазин + НРег(Товар.alies) + ">"+ Товар +"</A></td></tr>";
		КонецЦикла;
		
	   	ТемаПисьма = "Заявка на согласование товара рассмотрена коммерческой службой"; 

		ТекстПисьма = ТекстПисьмаЗаголовок + ТекстПисьмаТело + "</table>" + КэшируемыеФункции.ПолучитьПодвалПисьма();

		Письмо = ОбщиеФункции.ОповеститьПоПочте(Кому, ТемаПисьма, ТекстПисьма, Ложь, Перечисления.ТипыТекстовЭлектронныхПисем.HTML);
		
		Если Письмо = Неопределено Тогда
			ЗаписьЖурналаРегистрации("Данные.Запись", УровеньЖурналаРегистрации.Ошибка, , , 
				ОписаниеОшибки() + "
				|получатель = " + Получатель + "
				|товар = " + Товар);
			
			Возврат Ложь; 
		КонецЕсли;
	
		//ВыборкаТовары.Сбросить(); 
		//Пока ВыборкаТовары.Следующий() Цикл
		//	
		//	Товар = ВыборкаТовары.Номенклатура;
		//	
		//	ТекущийЗапрос = РегистрыСведений.ЗапросНаСогласованиеТовара.СоздатьНаборЗаписей();
		//	ТекущийЗапрос.Отбор.Пользователь.Установить(Получатель);
		//	ТекущийЗапрос.Отбор.Номенклатура.Установить(Товар);
		//	ТекущийЗапрос.Прочитать();
		//	//ЗаполнитьЗначенияСвойств(ТекущийЗапрос, ВыборкаТовары);
		//	Для Каждого Строка ИЗ ТекущийЗапрос Цикл
		//		Строка.ДокументСогласования = Ссылка;
		//		Строка.Статус = 3; КонецЦикла;

		//	Попытка
		//		ТекущийЗапрос.Записать();
		//	Исключение
		//		ЗаписьЖурналаРегистрации("Данные.Запись", УровеньЖурналаРегистрации.Ошибка, , , 
		//		ОписаниеОшибки() + "
		//		|получатель = " + Получатель + "
		//		|товар = " + Товар);
		//		Возврат Ложь;
		//	КонецПопытки;
		//
		//КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;

	Возврат Истина;
	
КонецФункции
